import { ICarouselItem } from "../interfaces/interfaces";

export const carouselProductsData: ICarouselItem[] = [
    {
      id: 1,
      content:
        "Для профессионального применения соответствует требованиям заказчика в отношении долговечности и надежности продукта.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
  ];
  
  export const markingSystemData = [
    {
      id: 1,
      name: "RS / 2RS",
      content:
        "Бесконтактное уплотнение из бутадиен-акрилонитрилового каучука (NBR) с одной /обеих сторон подшипника *",
    },
    {
      id: 2,
      name: "RSR / 2RSR *",
      content:
        "Смежное уплотнение из бутадиен-акрилонитрилового каучука(NBR) с одной / обеих сторон подшипника *",
    },
    {
      id: 3,
      name: "N*",
      content: "Канавка под стопорное кольцо во внешнем кольце подшипника*",
    },
  ];
  
  export const prefixesData = [
    {
      id: 1,
      name: "SS*",
      content: "Нержавеющая сталь *",
    },
  ];
  export const radialData = [
    {
      id: 1,
      name: "C2",
      content: "Зазор подшипника меньше нормального",
    },
    {
      id: 2,
      name: "CN",
      content: "Нормальный зазор",
    },
    {
      id: 3,
      name: "C3",
      content: "Зазор подшипника больше нормального ",
    },
    {
      id: 4,
      name: "C4",
      content: "Зазор в подшипнике больше чем С3",
    },
    {
      id: 5,
      name: "C5",
      content: "Зазор в подшипнике больше чем C4",
    },
  ];
  export const pierceClassesData = [
    {
      id: 1,
      name: "P0",
      content: "Нормальная (стандартный класс точности)",
    },
    {
      id: 1,
      name: "P6",
      content: "Повышенная (класс точности выше P0)",
    },
    {
      id: 1,
      name: "P5",
      content: "высокая (класс точности выше P6) *",
    },
  ];

  export const productsList = [
    {
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products-bg.svg',
    },
    {
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products-bg.svg',
    },
    {
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products-bg.svg',
    },
    {
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products-bg.svg',
    },
    {
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products-bg.svg',
    },
    {
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products-bg.svg',
    },
    {
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products-bg.svg',
    },
    {
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products-bg.svg',
    },
    {
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products-bg.svg',
    },
  ]