import { ICarouselItem } from "../interfaces/interfaces";

export const carouselProductsData: ICarouselItem[] = [
    {
      id: 1,
      content:
        "Для профессионального применения соответствует требованиям заказчика в отношении долговечности и надежности продукта.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
  ];
  
  export const markingSystemData = [
    {
      id: 1,
      name: "RS / 2RS",
      content:
        "Бесконтактное уплотнение из бутадиен-акрилонитрилового каучука (NBR) с одной /обеих сторон подшипника *",
    },
    {
      id: 2,
      name: "RSR / 2RSR *",
      content:
        "Смежное уплотнение из бутадиен-акрилонитрилового каучука(NBR) с одной / обеих сторон подшипника *",
    },
    {
      id: 3,
      name: "N*",
      content: "Канавка под стопорное кольцо во внешнем кольце подшипника*",
    },
  ];
  
  export const prefixesData = [
    {
      id: 1,
      name: "SS*",
      content: "Нержавеющая сталь *",
    },
  ];
  export const radialData = [
    {
      id: 1,
      name: "C2",
      content: "Зазор подшипника меньше нормального",
    },
    {
      id: 2,
      name: "CN",
      content: "Нормальный зазор",
    },
    {
      id: 3,
      name: "C3",
      content: "Зазор подшипника больше нормального ",
    },
    {
      id: 4,
      name: "C4",
      content: "Зазор в подшипнике больше чем С3",
    },
    {
      id: 5,
      name: "C5",
      content: "Зазор в подшипнике больше чем C4",
    },
  ];
  export const pierceClassesData = [
    {
      id: 1,
      name: "P0",
      content: "Нормальная (стандартный класс точности)",
    },
    {
      id: 1,
      name: "P6",
      content: "Повышенная (класс точности выше P0)",
    },
    {
      id: 1,
      name: "P5",
      content: "высокая (класс точности выше P6) *",
    },
  ];

  export const productsList = [
    {
      id: "deep-groove-ball-bearings",
      name: 'Подшипники радиальные шариковые',
      productNumber: 1,
      productImage: '/imports/products/products-bg-1.svg',
      previewText: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',

      productInfoAboveBearing: "Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки. Благодаря относительно простой конструкции подшипников, простой установке и невысокой стоимости замены, многие из современных устройств и машин используют их в ежедневной работе. ",
      productInfoAboveBluePrint: "Чаще всего используются малогабаритные формы. Результаты их работы можно увидеть практически везде – именно они являются конструктивным элементом небольших электрических устройств, бытового оборудования, а также спортивных аксессуаров. Доминирующей сферой крупногабаритных форм шарикоподшипников прежде всего является легкая промышленность. Дополнительные защитные пластинки (обозначенные в характеристике подшипника буквами Z или ZZ – для пластинок с обеих сторон), контактное уплотнение из каучука (обозначено буквами RS или 2RS – для обеих сторон) или латунные сепараторы – это лишь некоторые из всей гаммы вариантов шарикоподшипников. Для разного вида специализированных решений используются также соответствующие конструкционные материалы, например кислотоустойчивая сталь (обозначается SS) или латунные сепараторы для элементов качения. ",
      productInfoAboveBearIcon: "Конструкция шарикоподшипника, как однорядного, так и двухрядного, приблизительно одинаковая – в обоих случаях конструкция содержит внутреннее кольцо, внешнее кольцо и сепаратор с посаженными элементами качения – в данном случае шариками.  Стоит обратить внимание на разграничение с точки зрения ширины самого подшипника. Узкие радиальные шарикоподшипники прежде всего отличаются высоким показателем оборотных параметров. В свою очередь, широкие подшипники более жесткие и обладают большей несущей нагрузкой. Отдельные шарикоподшипники различаются между собой размерами и конструкционными типами – модификациями, которые позволяют расширить область применения основного подшипника. ",
      productInfoUnderBearIcon: "Достоинством решений, предлагаемых компанией VTL, является увеличенный срок эксплуатации продуктов, совмещенный с параметрами, представляющими собой производственный стандарт современных подшипников качения. Для обеспечения высочайшего качества производимых подшипников была создана специальная линия продукции марки VTL под названием SilverBear+, предназначенная для Клиентов, чьи ожидания и потребности превосходят стандартные.  Используемые материалы, конструкционные и технологические решения, а также современный контроль качества в этих подшипниках позволяют получать улучшенные эксплуатационные параметры, в том числе нагрузочную способность и скорость в среднем на 5 - 30% по отношению к стандартной продукции. ",

      productBlueprintTitle: "Радиальные шарикоподшипники, однорядные",
      productBlueprintImages:[
      {
        id: 1,
        imagePath: '/imports/blueprints/blueprint_1-1.svg'
      },
      {
        id: 2,
        imagePath: '/imports/blueprints/blueprint_1-2.svg'
      },
      {
        id: 3,
        imagePath: '/imports/blueprints/blueprint_1-3.svg'
      },
    ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "RS / 2RS",
            description: "бесконтактное уплотнение из бутадиен-акрилонитрилового каучука (NBR) с одной / обеих сторон подшипника *"
          },
          {
            id: 2,
            name: "RSR / 2RSR",
            description: "смежное уплотнение из бутадиен-акрилонитрилового каучука (NBR) с одной / обеих сторон подшипника * "
          },
          {
            id: 3,
            name: "Z / ZZ",
            description: "бесконтактная защитная металическая пластинка с одной / обеих сторон подшипника "
          },
          {
            id: 4,
            name: "ZR / ZZR",
            description: "смежная защитная металлическая пластина с одной / обеих сторон подшипника"
          },
          {
            id: 5,
            name: "N *",
            description: "канавка под стопорное кольцо во внешнем кольце подшипника *"
          },
          {
            id: 6,
            name: "NR *",
            description: "канавка под стопорное кольцо во внешнем кольце подшипника, с пружинящим стопорным кольцом * "
          },
          {
            id: 7,
            name: "N1 *",
            description: "один крепежный паз на одной стороне наружного кольца * "
          },
          {
            id: 8,
            name: "R *",
            description: "подшипник с фланцем на внешнем кольце * "
          },
          {
            id: 9,
            name: "E *",
            description: "усиленная группа элементов качения * "
          },
          {
            id: 10,
            name: "M",
            description: "латунный сепаратор на элементах качения"
          },
          {
            id: 11,
            name: "MA",
            description: "латунный сепратор на внешнем кольце "
          },
          {
            id: 12,
            name: "MB",
            description: "латунный сепаратор на внутреннем кольце"
          }
        ],
        prefixes:[
          {
            id: 1,
            name: "SS *",
            description: "нержавеющая сталь *"
          }
        ],
        radialClearances:[
          {
            id:1,
            name: 'C2',
            description:'зазор подшипника меньше нормального '
          },
          {
            id:2,
            name: 'CN',
            description:'нормальный зазор'
          },
          {
            id:3,
            name: 'C3',
            description:'зазор подшипника больше нормального'
          },
          {
            id:4,
            name: 'C4',
            description:'зазор в подшипнике больше чем С3 '
          },
          {
            id:5,
            name: 'C5',
            description:'зазор в подшипнике больше чем C4 '
          }
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0) '
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) * '
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          }
        ]
      }
    },
    {
      id: "angular-contact-ball-bearings",
      name: 'Радиально-упорные шарикоподшипники',
      productNumber: 2,
      productImage: '/imports/products/products-bg-2.svg',
      previewText: 'Универсальная и экономичная конструкция радиальноупорных шарикоподшипников позволяет успешно применять их практически во всех отраслях промышленности, например, в автомобилестроении (ступицы колес).',

      productInfoAboveBearing: "Универсальная и экономичная конструкция радиальноупорных шарикоподшипников позволяет успешно применять их практически во всех отраслях промышленности, например, в автомобилестроении (ступицы колес). Очень важным аспектом конструкции радиально-упорных шарикоподшипников является факт, что они переносят как радиальные, так и осевые нагрузки в соответствующем направлении.",
      productInfoAboveBluePrint: "Это связано с тем, что беговая дорожка внешнего кольца расположена под углом, что позволяет намного более эффективно переносить осевые нагрузки в направлении наклона. Чтобы обеспечить соответствующую стойкость и производительность, необходимо подобрать подшипник на основании рабочего угла дорожки. Она может находиться под углом 30°, 40° или 25° соответственно. Сепараторы для такого типа конструкций это, прежде всего, полиамидные элементы, дополнительно усиленные стекловолокном, однако в предложение входят также модели с металлическими или латунными сепараторами. Элементами качения являются шарики, в связи с чем подшипник работает очень тихо, элементы движутся плавно, что обеспечивает высокую производительность даже при высоких оборотах.",
      productInfoAboveBearIcon: "Радиально-упорные шарикоподшипники доступны в однорядном и двухрядном вариантах одностороннего действия, а также однорядном двустороннего действия. Два первых – это классическая конструкция, с успехом применяющаяся в ступицах колес, повсеместно устанавливаемых в автомобилях. Радиально-упорные однорядные двустороннего действия подшипники работают похожим способом, перенося нагрузки в обе стороны, однако нетипичная конструкция позволяет их применять в структурах, требующих большей точности. Также стоит отметить, что такого типа подшипники часто используются парами, однако можно встретить конструкции, в которых используются большие комбинации – тройные или четверные. ",
      productInfoUnderBearIcon: "Заботясь о высочайшем качестве производимых подшипников, была создана специальная линейка продуктов марки VTL с наименованием SilverBear+ для Клиентов, ожидания и требования которых превышают стандартные. Использованные материалы, конструкционные и технологические решения, а также продвинутый контроль качества в случае данных подшипников позволяют получить рабочие параметры, в том числе грузоподъемность и скорость, превышающие стандартные продукты на 5-30%. Универсальная и экономичная конструкция радиально- -упорных шарикоподшипников позволяет успешно их применять практически во всех отраслях промышленности, например в автомобильной (ступицы колес)",

      productBlueprintTitle: "Радиально-упорные шарикоподшипники",
      productBlueprintImages:[
      {
        id: 1,
        imagePath: '/imports/blueprints/blueprint_2-1.svg'
      }
    ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "A",
            description: "передний угол 30 °"
          },
          {
            id: 2,
            name: "B",
            description: "передний угол 40 °"
          },
          {
            id: 3,
            name: "AC",
            description: "передний угол 25 °"
          },
          {
            id: 4,
            name: "P",
            description: "полиамидный сепаратор, выполненный из материала РА66, усиленный "
          },
          {
            id: 5,
            name: "J",
            description: "стальной штампованный сепаратор, ведомыйна элементах качения, незакаленный"
          },
          {
            id: 6,
            name: "M",
            description: "латунный сепаратор на элементах качения"
          },
          {
            id: 7,
            name: "UA *",
            description: "в универсальной парной установке подшипников (схема тандем), подшипниковые пары О и Х имеют небольшой осевой зазорwy *"
          },
          {
            id: 8,
            name: "UL *",
            description: "в универсальной парной установке подшипников, подшипниковые пары О и Х имеют малый предварительный натяг *"
          },
          {
            id: 9,
            name: "UO *",
            description: "в универсальной парной установке подшипников, подшипниковые пары О и Х не имеют зазора *"
          },
          {
            id: 10,
            name: "RS / 2RS",
            description: "бесконтактное уплотнение из бутадиен -акрилонитрилового каучука (NBR) с одной / обеих сторон подшипника"
          },
          {
            id: 11,
            name: "Z / ZZ",
            description: "бесконтактная защитная металическая пластинка с одной / обеих сторон подшипника"
          },
          {
            id: 12,
            name: "N2",
            description: "два крепежных отверстия на одной стороне наружного"
          },
          {
            id: 13,
            name: "MA",
            description: "латунный сепаратор машинной обработки, ведомый на внешнем кольце"
          },
        ],
        axialClearances:[
          {
            id:1,
            name: 'C2',
            description:'зазор подшипника меньше нормального'
          },
          {
            id:2,
            name: 'CN',
            description:'нормальный зазор'
          },
          {
            id:3,
            name: 'C3',
            description:'зазор подшипника больше нормального'
          },
          {
            id:4,
            name: 'C4',
            description:'зазор в подшипнике больше чем С3'
          },
          {
            id:5,
            name: 'C5',
            description:'зазор в подшипнике больше чем C4'
          }
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0'
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) *'
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          }
        ]
      }
    },
    {
      id: "self-aligning-ball-bearings",
      name: 'Самоустанавливающиеся шарикоподшипники',
      productNumber: 3,
      productImage: '/imports/products/products-bg-3.svg',
      previewText: 'Важнейшим свойством самоустанавливающихся шарикоподшипников является способность переносить составные нагрузки, благодаря чему они могут выдержать очень большие перегрузки',

      productInfoAboveBearing: "Важнейшим свойством самоустанавливающихся шарикоподшипников является способность переносить составные нагрузки, благодаря чему они могут выдержать очень большие перегрузки. Они состоят из двойного ряда элементов качения и кольца со сферической дорожкой. Благодаря такой конструкции оба кольца могут располагаться друг относительно друга под произвольным углом.",
      productInfoAboveBluePrint: "Это позволяет автоматически уменьшать погрешности и выравнивать отклонения. Монтаж подшипников зависит от выполненного во внутреннем кольце отверстия. Подшипники с цилиндрическим отверстием устанавливаются непосредственно на валу, а подшипники с коническим отверстием устанавливаются в двух вариантах: непосредственно на конической цапфе или с применением втулки, втягиваемой на цилиндрическую цапфу. ",
      productInfoAboveBearIcon: "Самоустанавливающиеся шарикоподшипники марки Silver Bear имеют сепараторы из полиамида, усиленного стекловолокном, металлические или латунные. Предлагаются подшипники как с цилиндрическими, так и коническими отверстиями, в обеих версиях – с дополнительным уплотнением или открытые. Следует отметить, что версии без уплотнения имеют больший угол отклонения. ",
      productInfoUnderBearIcon: "Заботясь о высочайшем качестве производимых подшипников, была создана специальная линейка продуктов марки VTL с наименованием SilverBear+ для Клиентов ожидания и требования которых превышают стандартные. Использованные материалы, конструкционные и технологические решения, а также продвинутый контроль качества в случае данных подшипников позволяют получить рабочие параметры, в том числе грузоподъемность и скорость, превышающие стандартные продукты на 5-30%. Универсальные свойства самоустанавливающихся шарикоподшипников и большой допуск на монтажные проблемы и прогибы вала – это особенности, благодаря которым они нашли свое применение во многих конструкциях.",

      productBlueprintTitle: "Радиально-упорные шарикоподшипники",
      productBlueprintImages:[
        {
          id: 1,
          imagePath: '/imports/blueprints/blueprint_3-1.svg'
        },
        {
          id: 2,
          imagePath: '/imports/blueprints/blueprint_3-2.svg'
        },
        {
          id: 3,
          imagePath: '/imports/blueprints/blueprint_3-3.svg'
        },
        {
          id: 4,
          imagePath: '/imports/blueprints/blueprint_3-4.svg'
        },
    ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "P",
            description: "полиамидный сепаратор, выполненный из материала РА66, усиленный стекловолокном, ведомый на элементах качения."
          },
          {
            id: 2,
            name: "J",
            description: "стальной штампованный сепаратор, ведомыйна элементах качения, незакаленный"
          },
          {
            id: 3,
            name: "M",
            description: "стальной штампованный сепаратор, ведомыйна элементах качения, незакаленный "
          },
          {
            id: 4,
            name: "RS / 2RS",
            description: "бесконтактное уплотнение из бутадиен -акрилонитрилового каучука (NBR) с одной / обеих сторон подшипника"
          },
          {
            id: 5,
            name: "K",
            description: "коническое отверстие, конус 1:12"
          },
        ],
        radialClearances:[
          {
            id:1,
            name: 'C2',
            description:'зазор подшипника меньше нормального'
          },
          {
            id:2,
            name: 'CN',
            description:'нормальный зазор'
          },
          {
            id:3,
            name: 'C3',
            description:'зазор подшипника больше нормального'
          },
          {
            id:4,
            name: 'C4',
            description:'зазор в подшипнике больше чем С3'
          },
          {
            id:5,
            name: 'C5',
            description:'зазор в подшипнике больше чем C4'
          },
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 1,
            name: 'P6',
            description: 'повышенная (класс точности выше P0)'
          },
          {
            id: 1,
            name: 'P5',
            description: 'высокая (класс точности выше P6) *'
          },
          {
            id: 1,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          },
        ]
      }
    },
    {
      id: "tapered-roller-bearings",
      name: 'Конические роликовые подшипники',
      productNumber: 4,
      productImage: '/imports/products/products-bg-4.svg',
      previewText: 'Там, где шариковые подшипники не могут выполнить свои задания ввиду необходимости переноса осевых и радиальных сил, идеальным решением станут роликовые подшипники.',

      productInfoAboveBearing: "Там, где шариковые подшипники не могут выполнить свои задания ввиду необходимости переноса осевых и радиальных сил, идеальным решением станут роликовые подшипники. Этот тип подшипников повсеместно применяется в машинах, работающих во многих отраслях промышленности – как в сельском хозяйстве или пищевой промышленности, так и в сложных установках, работающих на заводах (тяжелая промышленность).",
      productInfoAboveBluePrint: "Ввиду своих характеристик и сравнительно более высокому сроку эксплуатации, роликовые подшипники часто заменяют собой в специализированных решениях опорные подшипники – как шариковые, так и бочкообразные роликоподшипники. Благодаря этому, даже в предметах повседневного пользования, например в автомобилях, группы роликовых подшипников справляются с задачей лучше, чем их конкуренты с другой конструкцией. И х форма позволяет выполнять двойственную работу: в зависимости от применения могут вести себя как радиальные подшипники, а также имитировать работу опорных подшипников. Выделяем два основных типа маркировки роликовых подшипников – метрическую и дюймовую. Во втором случае отдельно указываются размеры для составных частей подшипника (отдельно внутренний модуль и отдельно внешнее кольцо). В свою очередь метрическая маркировка, согласно стандартам ISO, указывает размер всего подшипника. ",
      productInfoAboveBearIcon: "В конструкционной схеме роликовых подшипников следует выделить два основных элемента, т. е. внутреннее и внешнее кольца. Сердцем первого является сепаратор, в котором находятся конусные элементы качения со стертыми вершинами. Правильное качение роликов по дорожкам обеспечивается способом их расположения – все образующие срезанных конусов пересекаются в одной точке на оси подшипника. Мы уверены, что множество вариантов, а также качество ассортимента, предлагаемого компанией VTL Poland в данном разделе, поможет найти и подобрать идеальное решение для Вашей конструкции. ",
      productInfoUnderBearIcon: "Для обеспечения высочайшего качества производимых подшипников была создана специальная линия продукции марки VTL под названием SilverBear+, предназначенная для Клиентов, чьи ожидания и потребности превосходят стандартные. Используемые материалы, конструкционные и технологические решения, а также современный контроль качества в этих подшипниках позволяют получать улучшенные эксплуатационные параметры, в том числе нагрузочную способность и скорость в среднем на 5 - 30% по отношению к стандартной продукции",

      productBlueprintTitle: "Undefined",
      productBlueprintImages:[
        {
          id: 1,
          imagePath: '/imports/blueprints/blueprint_4-1.svg'
        },
    ],
    // Not ready yet...
      marking:{
        suffixes:[
          {
            id: 1,
            name: "",
            description: ""
          }
        ],
        prefixes:[
          {
            id: 1,
            name: "",
            description: ""
          }
        ],
        radialClearances:[
          {
            id:1,
            name: '',
            description:''
          }
        ],
        axialClearances:[
          {
            id:1,
            name: '',
            description:''
          }
        ],
        accuracyClasses:[
          {
            id: 1,
            name: '',
            description: ''
          }
        ]
      }
    },
    {
      id: "cylindrical-radial-bearings",
      name: 'Цилиндрические радиальние подшипники',
      productNumber: 5,
      productImage: '/imports/products/products-bg-5.svg',
      previewText: 'Большое количество различающихся конструкций обеспечивает цилиндрическим подшипникам настоящую универсальность и широту применений.',

      productInfoAboveBearing: "Большое количество различающихся конструкций обеспечивает цилиндрическим подшипникам настоящую универсальность и широту применений. Конструкция цилиндрического подшипника базируется на сепараторе с элементами качения (в данном случае – ролики), который неподвижно закреплена на одном из колец.",
      productInfoAboveBluePrint: "Множество вариантов конструкций связано с разнообразием форм второго кольца – свободного. Также доступны модели, которые не имеют второго кольца (открытые, устанавливаемые непосредственно на вале или корпусе). Именно такая конструкция считается наиболее жесткой, но имеет ограничения по диапазону максимальной скорости вращения. Для обеспечения лучших параметров, для изготовления сепараторов используются полиамиды, дополнительно усиленные стекловолокном, однако в большинстве вариантов, они выполнены из стали или латуни. Отличительным свойством данного типа продуктов является возможность переноса значительных радиальных нагрузок. Также следует отметить, что по сравнению с другими типами подшипников, цилиндрические отличаются относительно более высокой жесткостью. ",
      productInfoAboveBearIcon: "Стоить отметить, что в случае цилиндрических подшипников также доступны модели, обозначенные символом Е (англ. Enhanced). Если в данном конкретном решении необходимо использовать компонент с лучшими параметрами грузоподъемности, чем стандартные, то такая конструкция идеально для этого подойдет. Удлиненные ролики с увеличенным диаметром позволяют переносить значительно большую нагрузку, чем стандартные. Однако это перекладывается на снижение скоростных параметров, потому что такой элемент качения медленнее вращается.",
      productInfoUnderBearIcon: "Предлагаемые компанией VTL Poland цилиндрические подшипники используются во всех отраслях промышленности. Благодаря разнообразным вариантам конструкций, их можно смело назвать универсальными. Для обеспечения высочайшего качества производимых подшипников была создана специальная линия продукции марки VTL под названием SilverBear+, предназначенная для Клиентов, чьи ожидания и потребности превосходят стандартные. Используемые материалы, конструкционные и технологические решения, а также современный контроль качества в этих подшипниках позволяют получать улучшенные эксплуатационные параметры, в том числе нагрузочную способность и скорость в среднем на 5 - 30% по отношению к стандартной продукции.",

      productBlueprintTitle: "Undefined",
      productBlueprintImages:[
        {
          id: 1,
          imagePath: '/imports/blueprints/blueprint_5-1.svg'
        },
        {
          id: 2,
          imagePath: '/imports/blueprints/blueprint_5-2.svg'
        },
        {
          id: 3,
          imagePath: '/imports/blueprints/blueprint_5-3.svg'
        },
        {
          id: 4,
          imagePath: '/imports/blueprints/blueprint_5-4.svg'
        },
        {
          id: 5,
          imagePath: '/imports/blueprints/blueprint_5-5.svg'
        },
    ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "P",
            description: "Полиамидный сепаратор, выполненный из материала РА66, усиленный стекловолокном, ведомый на элементах качения"
          },
          {
            id: 2,
            name: "J",
            description: "металлический штампованный сепаратор, ведомый на элементах качения, незакаленный"
          },
          {
            id: 3,
            name: "M",
            description: "Латунный сепаратор машинной обработки, ведомый на элементах качения"
          },
          {
            id: 4,
            name: "MA *",
            description: "латунный сепаратор машинной обработки, ведомый на внешнем кольце *"
          },
          {
            id: 5,
            name: "MB *",
            description: "латунный сепаратор машинной обработки, ведомый на внутреннем кольце *"
          },
          {
            id: 6,
            name: "E",
            description: "Оптимизированная внутренняя конструкция, содержащая больше и / или более крупные элементы качения, а также модифицированный стык конца / фланца элемента качения, повышенная грузоподъемность"
          },
          {
            id: 7,
            name: "V",
            description: "подшипник с полным количеством элементов качения (без сепаратора)"
          },
          {
            id: 8,
            name: "CV",
            description: "Модифицированная внутренняя конструкция, подшипник с полным количеством элементов качения Цилиндрические радиальные подшипники Схема размеров цилиндрических радиальных подшипников, однорядных * - вариант доступный по индивидуальному заказу клиента"
          },
        ],
        prefixes:[
          {
            id: 1,
            name: "N",
            description: "осевое перемещение внешнего кольца в обоих направлениях"
          },
          {
            id: 2,
            name: "NU",
            description: "осевое перемещение внутреннего кольца в обоих направлениях"
          },
          {
            id: 3,
            name: "NJ",
            description: "осевое перемещение внутреннего кольца в одном направлении"
          },
          {
            id: 4,
            name: "NUP",
            description: "отсутствие осевого перемещения "
          },
          {
            id: 5,
            name: "NF",
            description: "осевое перемещение внешнего кольца в одном направлении"
          },
        ],
        radialClearances:[
          {
            id:1,
            name: 'C2',
            description:'зазор подшипника меньше нормального'
          },
          {
            id:2,
            name: 'CN',
            description:'нормальный зазор'
          },
          {
            id:3,
            name: 'C3',
            description:'зазор подшипника больше нормального'
          },
          {
            id:4,
            name: 'C4',
            description:'зазор в подшипнике больше чем С3'
          },
          {
            id:5,
            name: 'C5',
            description:'зазор в подшипнике больше чем С4'
          },
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0)'
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) *'
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          },
        ]
      }
    },
    {
      id: "cylindrical-radial-bearings-double-row",
      name: 'Цилиндрические радиальные подшипники, двухрядные',
      productNumber: 6,
      productImage: '/imports/products/products-bg-6.svg',
      previewText: 'Цилиндрические радиальные подшипники – это проверенные компоненты для специальных решений. Применяются в самых экстремальных условиях, могут выдержать наибольшие нагрузки.',

      productInfoAboveBearing: "Цилиндрические радиальные подшипники – это проверенные компоненты для специальных решений. Применяются в самых экстремальных условиях, могут выдержать наибольшие нагрузки. Благодаря своим свойствам, данный тип подшипников повсеместно применяется как в тяжелой промышленности, так и в транспорте.",
      productInfoAboveBluePrint: "Наиболее характерной особенностью данного типа подшипников является тот факт, что они могут переносить как осевые, так и радиальные нагрузки. Можно принять, что их грузоподъемность в три раза превышает грузоподъемность соответствующих шарикоподшипников при сравнимых оборотных параметрах. Если предвидится, что нагрузки могут быть повышенными и стандартная конструкция шарикоподшипника не справится с задачей, то следует подумать о применении цилиндрической конструкции. Такое решение повышает допуск на неточность выполнения самого вала. Также существенным аспектом является защита системы, когда для монтажа были применены втулки. Также стоит помнить о том, что вдавливаемые втулки существенно облегчают монтаж самого подшипника – это особенно важно для эргономии ремонтов и консервации.",
      productInfoAboveBearIcon: "Конструкция самого сепаратора, в котором посажены элементы качения, в основном выполняется из стального листа. Данный материал достаточен для большинства областей применения. В случае более требовательных условий сепаратор может быть выполнен из латуни, стали или полиамида. Допускается крепление цилиндрических радиальных подшипников на валу как непосредственное, так и с помощью специальных втулок, встречающихся во вдавливаемом или втягиваемом вариантах. С точки зрения конструкции относительно более простым и оптимальным будет использование втулок. Цилиндрические радиальные подшипники компании VTL Poland представляют собой конструкции наивысшей пробы. Если требуются долговечные, стойкие к нагрузкам компоненты, которые не подведут даже в экстремальных условиях, то подшипники VTL SilverBear – отличный выбор. ",
      productInfoUnderBearIcon: "Для обеспечения высочайшего качества производимых подшипников была создана специальная линия продукции марки VTL под названием SilverBear+, предназначенная для Клиентов, чьи ожидания и потребности превосходят стандартные. Используемые материалы, конструкционные и технологические решения, а также современный контроль качества в этих подшипниках позволяют получать улучшенные эксплуатационные параметры, в том числе нагрузочную способность и скорость в среднем на 5 - 30% по отношению к стандартной продукции.",

      productBlueprintTitle: "Undefined",
      productBlueprintImages:[
        {
          id: 1,
          imagePath: '/imports/blueprints/blueprint_6-1.svg'
        },
        {
          id: 2,
          imagePath: '/imports/blueprints/blueprint_6-2.svg'
        },
        {
          id: 3,
          imagePath: '/imports/blueprints/blueprint_6-3.svg'
        },
        {
          id: 4,
          imagePath: '/imports/blueprints/blueprint_6-4.svg'
        },
        {
          id: 5,
          imagePath: '/imports/blueprints/blueprint_6-5.svg'
        },
        {
          id: 6,
          imagePath: '/imports/blueprints/blueprint_6-6.svg'
        },
    ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "E",
            description: "оптимизированная внутренняя конструкция для повышения грузоподъемности, серии 213, 222 и 223: Бесфланцевое внутреннее кольцо и две штампованные сепараторы из стали d≤65 мм: Направляющее кольцо, ведомое на внутреннем кольце, d>65 мм: направляющее кольцо ведомое на сепараторе"
          },
          {
            id: 2,
            name: "CC",
            description: "крепящие фланцы на внутреннем кольце, направляющее кольцо, ведомое на внутреннем кольце, две штампованные стальные сепараторы"
          },
          {
            id: 3,
            name: "CA (M)",
            description: "крепящие фланцы на внутреннем кольце, направляющее кольцо, ведомое на внутреннем кольце, латунный сепаратор машинной обработки"
          },
          {
            id: 4,
            name: "MB *",
            description: "латунный сепаратор, двухсекционный, машинная обработка *"
          },
          {
            id: 5,
            name: "K",
            description: "коническое отверстие, схождение 1:12"
          },
          {
            id: 6,
            name: "W33",
            description: "смазочная канавка и три отверстия во внешнем кольце подшипника"
          },
          {
            id: 7,
            name: "VA405 *",
            description: "вибрационные подшипники, стальные штампованные сепараторы с поверхностным закаливанием *"
          },
          {
            id: 8,
            name: "G",
            description: "диаметр шага резьбы изменен, соответствует спецификации ISO"
          },
          {
            id: 9,
            name: "H",
            description: "смазка подводится масляным каналом со стороны резьбы и по канавке на внешнем кольце"
          },
        ],
        radialClearances:[
          {
            id:1,
            name: 'C2',
            description:'зазор подшипника меньше нормального'
          },
          {
            id:2,
            name: 'CN',
            description:'нормальный зазор'
          },
          {
            id:3,
            name: 'C3',
            description:'зазор подшипника больше нормального'
          },
          {
            id:4,
            name: 'C4',
            description:'зазор в подшипнике больше чем С3'
          },
          {
            id:5,
            name: 'C5',
            description:'зазор в подшипнике больше чем С4'
          },
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0)'
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) *'
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          },
        ]
      }
    },
    {
      id: "thrust-ball-bearings",
      name: 'Упорные шарикоподшипники',
      productNumber: 7,
      productImage: '/imports/products/products-bg-7.svg',
      previewText: 'Относительно несложная конструкция и экономичность исполнения делают этот тип подшипников широко используемым в машиностроении и сельскохозяйственной промышленности.',

      productInfoAboveBearing: "Относительно несложная конструкция и экономичность исполнения делают этот тип подшипников широко используемым в машиностроении и сельскохозяйственной промышленности. Конструктивными элементами подшипников одностороннего действия являются внутреннее кольцо, которое крепится непосредственно на валу, внешнее кольцо, крепящееся к корпусу, а также элементы качения – сепаратор с шариками.",
      productInfoAboveBluePrint: "Большинство сепараторов выполнены из полиамидного пластика, металла или латуни. Все упорные шарикоподшипники рассоединяются. Мы можем предложить подшипники с разными классами точности изготовления – начиная с P0, который является стандартом и отправной точкой для других классов, заканчивая P4, который успешно применяется в случае особо высоких требований. ",
      productInfoAboveBearIcon: "Следует принять во внимание, что элементы в плоской конструкции не предвидят возможности наличия какой- -либо несоосности между валом и корпусом.",
      productInfoUnderBearIcon: "Заботясь о высочайшем качестве производимых подшипников, была создана специальная линейка продуктов марки VTL с наименованием SilverBear+ для Клиентов ожидания и требования которых превышают стандартные. Использованные материалы, конструкционные и технологические решения, а также продвинутый контроль качества в случае данных подшипников позволяют получить рабочие параметры, в том числе грузоподъемность и скорость, превышающие стандартные продукты на 5-30%. Благодаря относительно простой конструкции и экономному исполнению данный тип подшипников повсеместно используется при строительстве машин и в сельском хозяйстве",

      productBlueprintTitle: "Undefined",
      productBlueprintImages:[
        {
          id: 1,
          imagePath: '/imports/blueprints/blueprint_7-1.svg'
        },
        {
          id: 2,
          imagePath: '/imports/blueprints/blueprint_7-2.svg'
        },
        {
          id: 3,
          imagePath: '/imports/blueprints/blueprint_7-3.svg'
        },
    ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "P",
            description: "полиамидный сепаратор, выполненный из материала РА66, усиленный стекловолокном, ведомый на элементах качения"
          },
          {
            id: 2,
            name: "J",
            description: "стальной штампованный сепаратор, ведомыйна элементах качения, незакаленный "
          },
          {
            id: 3,
            name: "M",
            description: "латунный сепаратор на элементах качения"
          },
          {
            id: 4,
            name: "U",
            description: "шайба упорная"
          },
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0)'
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) *'
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          },
        ]
      }
    },
    {
      id: "thrust-cylindrical-roller-bearings",
      name: 'Упорные цилиндрические роликоподшипники',
      productNumber: 8,
      productImage: '/imports/products/products-bg-8.svg',
      previewText: 'Конструкция упорных цилиндрических роликоподшипников аналогична радиально-упорным, где шарики являются телом качения. Благодаря этому они сохраняют свои свойства и успешно используются во всех отраслях промышленности. ',

      productInfoAboveBearing: "Конструкция упорных цилиндрических роликоподшипников аналогична радиально-упорным, где шарики являются телом качения. Благодаря этому они сохраняют свои свойства и успешно используются во всех отраслях промышленности. Конструктивная особенность упорных цилиндрических роликоподшипников заключается в использовании трех элементов – двух колец с обеих сторон подшипника (внутреннее и внешнее кольцо), а тaкже сепаратора.",
      productInfoAboveBluePrint: "В случае данной конструкции элементами качения являются ролики. Относительно простая конструкция и очень хорошие параметры являются залогом того, подшипники данного типа можно считать универсальными – благодаря этому многие отрасли решаются их использовать как для простых, так и для более сложных задач. Принимая решение об их использовании следует принять во внимание факт, что у этих подшипников скорость ниже, чем у соответствующих шариковых. Их рекомендуется применять там, где требуется большая грузоподъемность, которую обеспечивают элементы качения в виде роликов.",
      productInfoAboveBearIcon: "Все сепараторы, устанавливаемые в подшипниках VTL Silver Bear, выполнены из полиамида PA66 или стали. В некоторых случаях этот элемент выполняется из латуни. Стоит отметить, что все упорные цилиндрические роликоподшипники – это подшипники одностороннего действия.",
      productInfoUnderBearIcon: "Заботясь о высочайшем качестве производимых подшипников, была создана специальная линейка продуктов марки VTL с наименованием SilverBear+ для Клиентов, ожидания и требования которых превышают стандартные. Использованные материалы, конструкционные и технологические решения, а также продвинутый контроль качества в случае данных подшипников позволяют получить рабочие параметры, в том числе грузоподъемность и скорость, превышающие стандартные продукты на 5-30%. Конструкция упорных роликоподшипников схожа с конструкцией соответствующих шарикоподшипников. Благодаря этому они сохраняют свои свойства и широко применяются во всех отраслях промышленности.",

      productBlueprintTitle: "Undefined",
      productBlueprintImages:[
        {
          id: 1,
          imagePath: '/imports/blueprints/blueprint_8-1.svg'
        },
    ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "P",
            description: "полиамидный сепаратор, выполненный из материала РА66, усиленный стекловолокном, ведомый на элементах качения"
          },
          {
            id: 2,
            name: "J",
            description: "стальной штампованный сепаратор, ведомыйна элементах качения, незакаленный"
          },
          {
            id: 3,
            name: "M",
            description: "латунный сепаратор на элементах качения"
          },

        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0)'
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) *'
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          },
        ]
      }
    },
    {
      id: "spherical-roller-thrust-bearings",
      name: 'Упорные сферические роликоподшипники',
      productNumber: 9,
      productImage: '/imports/products/products-bg-9.svg',
      previewText: 'В ситуациях, где требуются экстремальные параметры грузоподъемности и скорости, нестандартные решения – следует сделать ставку на упорные сферические роликоподшипники. ',

      productInfoAboveBearing: "В ситуациях, где требуются экстремальные параметры грузоподъемности и скорости, нестандартные решения – следует сделать ставку на упорные сферические роликоподшипники. Конструкция упорных сферических роликоподшипников представляет собой комплект взаимодействующих элементов: внутреннего кольца, неподвижно соединенного с сепаратором и элементами качения, а также свободного внешнего кольца. ",
      productInfoAboveBluePrint: "Принимая во внимание габариты и специальное назначение, большинство сферических роликоподшипников выполняется из чрезвычайно стойкой латуни. В отличии от других конструкций, упорные сферические роликоподшипники эффективно переносят как осевые, так и радиальные нагрузки. Следует подчеркнуть факт, что данные подшипники являются самоустанавливающимися. В случае отсутствия соосности или при изгибе вала, подшипник сам исправляет погрешности, обеспечивая плавную и безотказную работу машины. Однако следует помнить о том, что подшипник необходимо правильно нагружать. Осевая нагрузка должна быть больше, чем половина радиальной нагрузки.",
      productInfoAboveBearIcon: "Сравнивая средние параметры можно заметить, что упорные сферические роликоподшипники имеют значительно большие коэффициенты по сравнении с шарикоподшипниками – зачастую почти в два раза. Упорные сферические роликоподшипники марки VTL Silver Bear прежде всего находят применение в добывающей промышленности, для постройки тяжелых машин и техники.",
      productInfoUnderBearIcon: "Заботясь о высочайшем качестве производимых подшипников, была создана специальная линейка продуктов марки VTL с наименованием SilverBear+ для Клиентов ожидания и требования которых превышают стандартные. Использованные материалы, конструкционные и технологические решения, а также продвинутый контроль качества в случае данных подшипников позволяют получить рабочие параметры, в том числе грузоподъемность и скорость, превышающие стандартные продукты на 5-30%",

      productBlueprintTitle: "",
      productBlueprintImages:[
        {
          id: 1,
          imagePath: '/imports/blueprints/blueprint_9-1.svg'
        },
    ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "P",
            description: "полиамидный сепаратор, выполненный из материала РА66, усиленный стекловолокном, ведомый на элементах качения"
          },
          {
            id: 2,
            name: "J",
            description: "стальной штампованный сепаратор, ведомыйна элементах качения, незакаленный"
          },
          {
            id: 3,
            name: "M",
            description: "латунный сепаратор на элементах качения"
          },
          {
            id: 4,
            name: "E",
            description: "оптимизированная внутренняя конструкция, содержащая больше и / или более крупные элементы качения, а также модифицированный стык конца / фланца элемента качения, повышенная грузоподъемность"
          },
          {
            id: 1,
            name: "EM",
            description: "оптимизированная внутренняя структура, содержащая все больше и / или более крупные элементы качения, повышенная грузоподъемность, обработаной латунний сепаратор, на направляющих элементах качения"
          },
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0)'
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) *'
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          },
        ]
      }
    },
    {
      id: "self-aligning-bearings",
      name: 'Самоустанавливающиеся подшипники',
      productNumber: 10,
      productImage: '/imports/products/products-bg-10.svg',
      previewText: 'Настоящий специальный тип подшипника используется в основном для коротких валов, а также в качестве опорных подшипников. С помощью осевого зазора компенсируются небольшие выступы вала.',

      productInfoAboveBearing: "Настоящий специальный тип подшипника используется в основном для коротких валов, а также в качестве опорных подшипников. С помощью осевого зазора компенсируются небольшие выступы вала. Универсальность самоустанавливающихся подшипников позволяет использовать их во многих отраслях промышленности: пищевой, швейной, строительной, сельскохозяйственной и горнодобывающей.",
      productInfoAboveBluePrint: "В отличие от радиальных, сферических, цилиндрических или конических шарикоподшипников, самоустанавливающиеся подшипники имеют сферическое внешнее кольцо. Такая форма позволяет устанавливать их в специальный корпус, в котором они приобретают свойства двухрядных подшипников.",
      productInfoAboveBearIcon: "Кроме того, каждый самоустанавливающийся подшипник имеет уплотнение из пластика, металла или металлопластика. Для правильной работы предусмотрена порция смазки, которой хватает на весь период эксплуатации в нормальных условиях. Важным фактором, влияющим на правильную работу в трудных условиях, является очень хорошая устойчивость к колебаниям центровки.",
      productInfoUnderBearIcon: "Для обеспечения высочайшего качества производимых подшипников была создана специальная линейка продуктов VTL под названием SilverBear+, предназначенная для клиентов, чьи ожидания и потребности превышают стандартные. Используемые материалы, конструктивные и технологические решения, а также повышенный контроль качества этих подшипников позволяют получить рабочие параметры, в том числе грузоподъемность и скорость, от 5 до 30% выше, по сравнению со стандартными продуктами",

      productBlueprintTitle: "Undefined",
      productBlueprintImages:[
        {
          id: 1,
          imagePath: '/imports/blueprints/blueprint_10-1.svg'
        },
        {
          id: 2,
          imagePath: '/imports/blueprints/blueprint_10-2.svg'
        },
        {
          id: 3,
          imagePath: '/imports/blueprints/blueprint_10-3.svg'
        },
        {
          id: 4,
          imagePath: '/imports/blueprints/blueprint_10-4.svg'
        },
        {
          id: 5,
          imagePath: '/imports/blueprints/blueprint_10-5.svg'
        },
        {
          id: 6,
          imagePath: '/imports/blueprints/blueprint_10-6.svg'
        },
    ],
      selfAligningGroups:[
        {
          id: 1,
          name: 'UC',
          description: "имеет асимметричное, удлиненное с двух сторон внутреннее кольцо"
        },
        {
          id: 2,
          name: 'UD',
          description: "характеризуется отсутствием модификации внутреннего кольца"
        },
        {
          id: 3,
          name: 'UE',
          description: "внутреннее кольцо выдвигается только с одной стороны, а на удлинении размещается специальное эксцентриковое фиксирующее кольцо"
        },
        {
          id: 4,
          name: 'UA',
          description: "внутреннее кольцо имеет удлинение с обеих сторон, а на удлинении размещено специальное эксцентриковое фиксирующее кольцо"
        },
        {
          id: 5,
          name: 'UK',
          description: "внутреннее кольцо имеет коническое отверстие с конусностью 1:12, в которое устанавливается втулка"
        },
        {
          id: 6,
          name: 'US',
          description: "внутреннее кольцо имеет удлинение только с одной стороны"
        },
      ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "L3 *",
            description: "тройное манжетное уплотнение *"
          }
        ],
        prefixes:[
          {
            id: 1,
            name: "SS *",
            description: "нержавеющая сталь *"
          }
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0)'
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) *'
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          },
        ]
      }
    },
    {
      id: "bearing-housings",
      name: 'Корпуса подшипников',
      productNumber: 11,
      productImage: '/imports/products/products-bg-11.svg',
      previewText: 'Благодаря относительно простой конструкции и широкому диапазону применения подшипниковые узлы входят в число наиболее часто используемых компонентов.',

      productInfoAboveBearing: "Благодаря относительно простой конструкции и широкому диапазону применения подшипниковые узлы входят в число наиболее часто используемых компонентов. Подшипниковые узлы часто похожи по конструкции на сферические роликовые или самоцентрирующиеся шарикоподшипники. Важно помнить, что назначение определяет всю сборку, а не отдельный компонент.",
      productInfoAboveBluePrint: "Важно правильно подобрать как самоцентрирующийся подшипник, так и корпус. В случае с подшипниками неправильный выбор приведет к неисправности устройства, а неправильный подбор корпуса часто ведет к проблемам сборки (неправильная форма корпуса, неверное расстояние между отверстиями).",
      productInfoAboveBearIcon: "Структура индексных обозначений подшипниковых узлов представляет собой сочетание буквенного обозначения корпуса и номера подшипника, входящего в узел. Чтобы четко различать конструкции, для отдельных вариантов добавлены соответствующие буквенные обозначения. Они отличаются в основном способом крепления на вал:",
      productInfoUnderBearIcon: "Несомненным преимуществом подшипниковых узлов является простота сборки и замены. Благодаря этому они используются во многих отраслях промышленности. Относительно низкая цена и очень хорошие коэффициенты компенсации погрешности соосности способствуют широкому распространению подшипниковых узлов в качестве стандартного компонента конструкции сельскохозяйственной и строительной техники. Также они успешно используются в пищевой, горнодобывающей и деревообрабатывающей промышленности и в производстве вентиляционного оборудования. Для обеспечения высочайшего качества производимых подшипников создана специальная серия изделий марки VTL под названием SilverBear+ для потребителей, чьи ожидания и потребности выше стандартных. Используемые материалы, конструкции и технологические решения, а также усовершенствованный контроль качества этих подшипников позволяют обеспечивать рабочие параметры, грузоподъемность и скорость на 5 – 30% выше стандартной продукции",

      productBlueprintTitle: "Undefined",
      productBlueprintImages:[
        {
          id: 1,
          imagePath: '/imports/blueprints/blueprint_11-1.svg'
        },
        {
          id: 2,
          imagePath: '/imports/blueprints/blueprint_11-2.svg'
        },
        {
          id: 3,
          imagePath: '/imports/blueprints/blueprint_11-3.svg'
        },
        {
          id: 4,
          imagePath: '/imports/blueprints/blueprint_11-4.svg'
        },
        {
          id: 5,
          imagePath: '/imports/blueprints/blueprint_11-5.svg'
        },
        {
          id: 6,
          imagePath: '/imports/blueprints/blueprint_11-6.svg'
        },
        {
          id: 7,
          imagePath: '/imports/blueprints/blueprint_11-7.svg'
        },
        {
          id: 8,
          imagePath: '/imports/blueprints/blueprint_11-8.svg'
        },
        {
          id: 9,
          imagePath: '/imports/blueprints/blueprint_11-9.svg'
        },
        {
          id: 10,
          imagePath: '/imports/blueprints/blueprint_11-10.svg'
        },
        {
          id: 11,
          imagePath: '/imports/blueprints/blueprint_11-11.svg'
        },
    ],
    waysFasteningShaft:[
      {
        id: 1,
        name: "Тип P",
        description: "корпус P устанавливается перпендикулярно оси вала, причем монтажные отверстия расположены непосредственно в корпусе. Существует версия типа PA, в которой монтажные отверстия расположены в основании корпуса."
      },
      {
        id: 2,
        name: "Тип F",
        description: "установка параллельна оси вала"
      },
      {
        id: 3,
        name: "Тип Т",
        description: "отличается формой, напоминающей букву Т, и благодаря такому креплению обеспечивается возможность регулировки натяжения. "
      },
    ],

      marking:{
        indexes:[
          {
            id: 1,
            name: "L3 *",
            description: "тройное манжетное уплотнение *"
          }
        ],
        prefixes:[
          {
            id: 1,
            name: 'SS *',
            description: 'нержавеющая сталь *'
          }
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0)'
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) *'
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          },
        ]
      }
    },
    {
      id: "plain-bearings",
      name: 'Подшипники скольжения',
      productNumber: 12,
      productImage: '/imports/products/products-bg-12.svg',
      previewText: 'Эти подшипники бывают разных конструкций и с различными комбинациями поверхностей скольжения. Характерные свойства каждой комбинации конструкции и механизма делают эти подшипники применимыми во многих областях. ',

      productInfoAboveBearing: "Эти подшипники бывают разных конструкций и с различными комбинациями поверхностей скольжения. Характерные свойства каждой комбинации конструкции и механизма делают эти подшипники применимыми во многих областях. Подшипники скольжения – эффективная альтернатива подшипникам качения. Их характеристики позволяют удовлетворить гораздо более высокие требования, чем доступны подшипникам качения. ",
      productInfoAboveBluePrint: "Наиболее важными из них являются более легкая сборка и разборка, меньшее поперечное сечение (размер узла), меньший вес и более низкая цена (особенно по сравнению с подшипниками качения с более сложной конструкцией). Наиболее важные группы: - сферические шариковые подшипники скольжения (подшипники GE и наконечники тяги - тип SA и SI) - радиально-упорные шариковые подшипники скольжения (GAC) - упорные шариковые подшипники скольжения (GX) Конструкция подшипников скольжения обеспечивает плавное возвратно-поступательное и колебательное движение вала или шейки относительно корпуса или седла. В отличие от подшипников качения, в моделях скольжения отсутствуют тела качения. Они работают по принципу скольжения – или трения скольжения – головки и шейки вала. Такое решение лучше всего подходит для очень высоких нагрузок при низких скоростях. Подшипники скольжения производятся во многих вариантах. ",
      productInfoAboveBearIcon: "Для выбора правильной модели следует учесть следующие факторы: нагрузка, размер, тип движения, скорость, тип трения, метод смазки, смазочные материалы. Также очень важны условия эксплуатации и окружающей среды. Если проигнорировать какой-либо фактор, правильный подбор соответствующего подшипника скольжения станет невозможным. Оптимальный материал для подшипников скольжения – материал с низким коэффициентом трения. Также имеет смысл инвестировать в решения с высокой устойчивостью к заклиниванию и коррозии, с оптимальным сопротивлением усталости и давлению, отличной теплопроводностью и отличной технологичностью.",
      productInfoUnderBearIcon: "Подшипники скольжения устанавливаются в ножничных механизмах, транспортных роликах или шарнирах. Они также используются в наручных часах, медицинских устройствах и сельскохозяйственной технике. В автомобильном секторе подшипники скольжения устанавливаются в тормозных системах, системах рулевого управления, сидений и педалей. Для обеспечения высочайшего качества производимых подшипников создана специальная линейка продукции марки VTL SilverBear+ для потребителей, чьи ожидания и потребности выше стандартных. Используемые материалы, конструкции и технологические решения, а также усовершенствованный контроль качества этих подшипников позволяют обеспечивать рабочие параметры, грузоподъемность и скорость на 5 – 30% выше стандартной продукции",

      productBlueprintTitle: "Undefined",
      productBlueprintImages:[
        {
          id: 1,
          imagePath: '/imports/blueprints/blueprint_3-1.svg'
        },
    ],
    shaftPinPairs:[
      {
        id: 1,
        name: "E, ES",
        description: "сталь – сталь"
      },
      {
        id: 2,
        name: "C",
        description: "cталь PTFE + спеченная бронза (PTFE - тефлон)"
      },
      {
        id: 3,
        name: "TXE, TXA",
        description: "хром – ткань PTFE (PTFE - тефлон)"
      },
      {
        id: 4,
        name: "GEP",
        description: "сталь – ткань PTFE, армированная волокном PTFE - тефлон)"
      },
    ],
      marking:{
        indexes:[
          {
            id: 1,
            name: "C",
            description: "Самосмазывающиеся скользящие поверхности"
          },
          {
            id: 2,
            name: "E",
            description: "Без канавки для смазки, смазка доступна только сбоку подшипника"
          },
          {
            id: 3,
            name: "ES",
            description: "Смазка возможна через смазочные отверстия и кольцевую канавку в обоих кольцах"
          },
          {
            id: 4,
            name: "TXE",
            description: "Самосмазывающиеся скользящие поверхности"
          },
          {
            id: 5,
            name: "TXA",
            description: "Самосмазывающиеся скользящие поверхности, внешнее кольцо с осевым разъемом"
          },
          {
            id: 6,
            name: "2RS",
            description: "Двойное манжетное уплотнение с обеих сторон"
          },
          {
            id: 7,
            name: "2LS",
            description: "Трехслойное уплотнение с двух сторон, прочнее, чем в 2RS"
          },
        ],
        prefixes:[
          {
            id: 1,
            name: "GE (GEZ)",
            description: "Сферический шариковый подшипник скольжения (GEZ – эквивалент в дюймах)"
          },
          {
            id: 2,
            name: "GEM (GEZM)",
            description: "Расширенное внутреннее кольцо с обеих сторон (GEZM – эквивалент в дюймах)"
          },
          {
            id: 3,
            name: "GEH (GEZH)",
            description: "Более широкое внутреннее кольцо и больший внешний диаметр по сравнению с GE (GEZ) ... ES для увеличения грузоподъемности и угла наклона (GEZH – эквивалент в дюймах)"
          },
          {
            id: 4,
            name: "GEP .. FS",
            description: "Наружное кольцо с радиальным разъемом, которое можно разъединить для упрощения установки, возможность автоматической смазки, заводская смазка, смазочные отверстия и кольцевая канавка в обоих кольцах"
          },
          {
            id: 5,
            name: "GEG",
            description: "Ширина внутреннего кольца равна диаметру отверстия"
          },
          {
            id: 6,
            name: "SA(L), SI(L)",
            description: "Наконечники тяги тип SA и SI (L = левая резьба), состоят из шарикового подшипника скольжения GE и корпуса."
          },
          {
            id: 7,
            name: "GAC",
            description: "Радиально-упорный шариковый подшипник скольжения, самосмазывающийся, с заводской смазкой, замена смазки не требуется, но она может продлить срок службы"
          },
          {
            id: 8,
            name: "GX",
            description: "Упорный шариковый подшипник скольжения, самосмазывающийся, с заводской смазкой, замена смазки не требуется, но она может продлить срок службы"
          },
        ],
        radialClearances:[
          {
            id:1,
            name: 'C2',
            description:'зазор подшипника меньше нормального '
          },
          {
            id:2,
            name: 'CN',
            description:'нормальный зазор'
          }
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'Стандартный класс точности'
          }
        ]
      }
    },
  ]