import { ICarouselItem } from "../interfaces/interfaces";

export const carouselProductsData: ICarouselItem[] = [
    {
      id: 1,
      content:
        "Для профессионального применения соответствует требованиям заказчика в отношении долговечности и надежности продукта.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
  ];
  
  export const markingSystemData = [
    {
      id: 1,
      name: "RS / 2RS",
      content:
        "Бесконтактное уплотнение из бутадиен-акрилонитрилового каучука (NBR) с одной /обеих сторон подшипника *",
    },
    {
      id: 2,
      name: "RSR / 2RSR *",
      content:
        "Смежное уплотнение из бутадиен-акрилонитрилового каучука(NBR) с одной / обеих сторон подшипника *",
    },
    {
      id: 3,
      name: "N*",
      content: "Канавка под стопорное кольцо во внешнем кольце подшипника*",
    },
  ];
  
  export const prefixesData = [
    {
      id: 1,
      name: "SS*",
      content: "Нержавеющая сталь *",
    },
  ];
  export const radialData = [
    {
      id: 1,
      name: "C2",
      content: "Зазор подшипника меньше нормального",
    },
    {
      id: 2,
      name: "CN",
      content: "Нормальный зазор",
    },
    {
      id: 3,
      name: "C3",
      content: "Зазор подшипника больше нормального ",
    },
    {
      id: 4,
      name: "C4",
      content: "Зазор в подшипнике больше чем С3",
    },
    {
      id: 5,
      name: "C5",
      content: "Зазор в подшипнике больше чем C4",
    },
  ];
  export const pierceClassesData = [
    {
      id: 1,
      name: "P0",
      content: "Нормальная (стандартный класс точности)",
    },
    {
      id: 1,
      name: "P6",
      content: "Повышенная (класс точности выше P0)",
    },
    {
      id: 1,
      name: "P5",
      content: "высокая (класс точности выше P6) *",
    },
  ];

  export const productsList = [
    {
      id: "deep-groove-ball-bearings",
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-1.svg',
      previewText: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',

      productInfoAboveBearing: "Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки. Благодаря относительно простой конструкции подшипников, простой установке и невысокой стоимости замены, многие из современных устройств и машин используют их в ежедневной работе. ",
      productInfoAboveBluePrint: "Чаще всего используются малогабаритные формы. Результаты их работы можно увидеть практически везде – именно они являются конструктивным элементом небольших электрических устройств, бытового оборудования, а также спортивных аксессуаров. Доминирующей сферой крупногабаритных форм шарикоподшипников прежде всего является легкая промышленность. Дополнительные защитные пластинки (обозначенные в характеристике подшипника буквами Z или ZZ – для пластинок с обеих сторон), контактное уплотнение из каучука (обозначено буквами RS или 2RS – для обеих сторон) или латунные сепараторы – это лишь некоторые из всей гаммы вариантов шарикоподшипников. Для разного вида специализированных решений используются также соответствующие конструкционные материалы, например кислотоустойчивая сталь (обозначается SS) или латунные сепараторы для элементов качения. ",
      productInfoAboveBearIcon: "Конструкция шарикоподшипника, как однорядного, так и двухрядного, приблизительно одинаковая – в обоих случаях конструкция содержит внутреннее кольцо, внешнее кольцо и сепаратор с посаженными элементами качения – в данном случае шариками.  Стоит обратить внимание на разграничение с точки зрения ширины самого подшипника. Узкие радиальные шарикоподшипники прежде всего отличаются высоким показателем оборотных параметров. В свою очередь, широкие подшипники более жесткие и обладают большей несущей нагрузкой. Отдельные шарикоподшипники различаются между собой размерами и конструкционными типами – модификациями, которые позволяют расширить область применения основного подшипника. ",
      productInfoUnderBearIcon: "Достоинством решений, предлагаемых компанией VTL, является увеличенный срок эксплуатации продуктов, совмещенный с параметрами, представляющими собой производственный стандарт современных подшипников качения. Для обеспечения высочайшего качества производимых подшипников была создана специальная линия продукции марки VTL под названием SilverBear+, предназначенная для Клиентов, чьи ожидания и потребности превосходят стандартные.  Используемые материалы, конструкционные и технологические решения, а также современный контроль качества в этих подшипниках позволяют получать улучшенные эксплуатационные параметры, в том числе нагрузочную способность и скорость в среднем на 5 - 30% по отношению к стандартной продукции. ",

      marking:{
        suffixes:[
          {
            id: 1,
            name: "RS / 2RS",
            description: "бесконтактное уплотнение из бутадиен-акрилонитрилового каучука (NBR) с одной / обеих сторон подшипника *"
          },
          {
            id: 2,
            name: "RSR / 2RSR",
            description: "смежное уплотнение из бутадиен-акрилонитрилового каучука (NBR) с одной / обеих сторон подшипника * "
          },
          {
            id: 3,
            name: "Z / ZZ",
            description: "бесконтактная защитная металическая пластинка с одной / обеих сторон подшипника "
          },
          {
            id: 4,
            name: "ZR / ZZR",
            description: "смежная защитная металлическая пластина с одной / обеих сторон подшипника"
          },
          {
            id: 5,
            name: "N *",
            description: "канавка под стопорное кольцо во внешнем кольце подшипника *"
          },
          {
            id: 6,
            name: "NR *",
            description: "канавка под стопорное кольцо во внешнем кольце подшипника, с пружинящим стопорным кольцом * "
          },
          {
            id: 7,
            name: "N1 *",
            description: "один крепежный паз на одной стороне наружного кольца * "
          },
          {
            id: 8,
            name: "R *",
            description: "подшипник с фланцем на внешнем кольце * "
          },
          {
            id: 9,
            name: "E *",
            description: "усиленная группа элементов качения * "
          },
          {
            id: 10,
            name: "M",
            description: "латунный сепаратор на элементах качения"
          },
          {
            id: 11,
            name: "MA",
            description: "латунный сепратор на внешнем кольце "
          },
          {
            id: 12,
            name: "MB",
            description: "латунный сепаратор на внутреннем кольце"
          }
        ],
        prefixes:[
          {
            id: 1,
            name: "SS *",
            description: "нержавеющая сталь *"
          }
        ],
        radialClearances:[
          {
            id:1,
            name: 'C2',
            description:'зазор подшипника меньше нормального '
          },
          {
            id:2,
            name: 'CN',
            description:'нормальный зазор'
          },
          {
            id:3,
            name: 'C3',
            description:'зазор подшипника больше нормального'
          },
          {
            id:4,
            name: 'C4',
            description:'зазор в подшипнике больше чем С3 '
          },
          {
            id:5,
            name: 'C5',
            description:'зазор в подшипнике больше чем C4 '
          }
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0) '
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) * '
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          }
        ]
      }
    },
    {
      id: 2,
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-2.svg',
    },
    {
      id: 3,
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-3.svg',
    },
    {
      id: 4,
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-4.svg',
    },
    {
      id: 5,
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-5.svg',
    },
    {
      id: 6,
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-6.svg',
    },
    {
      id: 7,
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-7.svg',
    },
    {
      id: 8,
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-8.svg',
    },
    {
      id: 9,
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-9.svg',
    },
    {
      id: 10,
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-10.svg',
    },
    {
      id: 11,
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-11.svg',
    },
    {
      id: 12,
      name: 'Подшипники радиальные шариковые',
      content: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',
      backgroungImg: '/imports/products/products-bg-12.svg',
    },
  ]