import { ICarouselItem } from "../interfaces/interfaces";

export const carouselProductsData: ICarouselItem[] = [
    {
      id: 1,
      content:
        "Для профессионального применения соответствует требованиям заказчика в отношении долговечности и надежности продукта.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
    {
      id: 2,
      content:
        "Подшипники SilverBear изготовлены из высококачественной стали и подвергается контролируемой термообработке.",
    },
  ];
  
  export const markingSystemData = [
    {
      id: 1,
      name: "RS / 2RS",
      content:
        "Бесконтактное уплотнение из бутадиен-акрилонитрилового каучука (NBR) с одной /обеих сторон подшипника *",
    },
    {
      id: 2,
      name: "RSR / 2RSR *",
      content:
        "Смежное уплотнение из бутадиен-акрилонитрилового каучука(NBR) с одной / обеих сторон подшипника *",
    },
    {
      id: 3,
      name: "N*",
      content: "Канавка под стопорное кольцо во внешнем кольце подшипника*",
    },
  ];
  
  export const prefixesData = [
    {
      id: 1,
      name: "SS*",
      content: "Нержавеющая сталь *",
    },
  ];
  export const radialData = [
    {
      id: 1,
      name: "C2",
      content: "Зазор подшипника меньше нормального",
    },
    {
      id: 2,
      name: "CN",
      content: "Нормальный зазор",
    },
    {
      id: 3,
      name: "C3",
      content: "Зазор подшипника больше нормального ",
    },
    {
      id: 4,
      name: "C4",
      content: "Зазор в подшипнике больше чем С3",
    },
    {
      id: 5,
      name: "C5",
      content: "Зазор в подшипнике больше чем C4",
    },
  ];
  export const pierceClassesData = [
    {
      id: 1,
      name: "P0",
      content: "Нормальная (стандартный класс точности)",
    },
    {
      id: 1,
      name: "P6",
      content: "Повышенная (класс точности выше P0)",
    },
    {
      id: 1,
      name: "P5",
      content: "высокая (класс точности выше P6) *",
    },
  ];

  export const productsList = [
    {
      id: "deep-groove-ball-bearings",
      name: 'Подшипники радиальные шариковые',
      productNumber: 1,
      productImage: '/imports/products/products-bg-1.svg',
      previewText: 'Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки.',

      productInfoAboveBearing: "Самым популярным типом подшипников качения являются шариковые подшипники. В зависимости от формы канавки подшипника, они могут переносить радиальные, а также, в меньшей степени, осевые нагрузки. Благодаря относительно простой конструкции подшипников, простой установке и невысокой стоимости замены, многие из современных устройств и машин используют их в ежедневной работе. ",
      productInfoAboveBluePrint: "Чаще всего используются малогабаритные формы. Результаты их работы можно увидеть практически везде – именно они являются конструктивным элементом небольших электрических устройств, бытового оборудования, а также спортивных аксессуаров. Доминирующей сферой крупногабаритных форм шарикоподшипников прежде всего является легкая промышленность. Дополнительные защитные пластинки (обозначенные в характеристике подшипника буквами Z или ZZ – для пластинок с обеих сторон), контактное уплотнение из каучука (обозначено буквами RS или 2RS – для обеих сторон) или латунные сепараторы – это лишь некоторые из всей гаммы вариантов шарикоподшипников. Для разного вида специализированных решений используются также соответствующие конструкционные материалы, например кислотоустойчивая сталь (обозначается SS) или латунные сепараторы для элементов качения. ",
      productInfoAboveBearIcon: "Конструкция шарикоподшипника, как однорядного, так и двухрядного, приблизительно одинаковая – в обоих случаях конструкция содержит внутреннее кольцо, внешнее кольцо и сепаратор с посаженными элементами качения – в данном случае шариками.  Стоит обратить внимание на разграничение с точки зрения ширины самого подшипника. Узкие радиальные шарикоподшипники прежде всего отличаются высоким показателем оборотных параметров. В свою очередь, широкие подшипники более жесткие и обладают большей несущей нагрузкой. Отдельные шарикоподшипники различаются между собой размерами и конструкционными типами – модификациями, которые позволяют расширить область применения основного подшипника. ",
      productInfoUnderBearIcon: "Достоинством решений, предлагаемых компанией VTL, является увеличенный срок эксплуатации продуктов, совмещенный с параметрами, представляющими собой производственный стандарт современных подшипников качения. Для обеспечения высочайшего качества производимых подшипников была создана специальная линия продукции марки VTL под названием SilverBear+, предназначенная для Клиентов, чьи ожидания и потребности превосходят стандартные.  Используемые материалы, конструкционные и технологические решения, а также современный контроль качества в этих подшипниках позволяют получать улучшенные эксплуатационные параметры, в том числе нагрузочную способность и скорость в среднем на 5 - 30% по отношению к стандартной продукции. ",

      productBlueprintTitle: "Радиальные шарикоподшипники, однорядные",
      productBlueprintImages:[
      {
        id: 1,
        imagePath: '/imports/blueprints/blueprint_1-1.svg'
      },
      {
        id: 2,
        imagePath: '/imports/blueprints/blueprint_1-2.svg'
      },
      {
        id: 3,
        imagePath: '/imports/blueprints/blueprint_1-3.svg'
      },
    ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "RS / 2RS",
            description: "бесконтактное уплотнение из бутадиен-акрилонитрилового каучука (NBR) с одной / обеих сторон подшипника *"
          },
          {
            id: 2,
            name: "RSR / 2RSR",
            description: "смежное уплотнение из бутадиен-акрилонитрилового каучука (NBR) с одной / обеих сторон подшипника * "
          },
          {
            id: 3,
            name: "Z / ZZ",
            description: "бесконтактная защитная металическая пластинка с одной / обеих сторон подшипника "
          },
          {
            id: 4,
            name: "ZR / ZZR",
            description: "смежная защитная металлическая пластина с одной / обеих сторон подшипника"
          },
          {
            id: 5,
            name: "N *",
            description: "канавка под стопорное кольцо во внешнем кольце подшипника *"
          },
          {
            id: 6,
            name: "NR *",
            description: "канавка под стопорное кольцо во внешнем кольце подшипника, с пружинящим стопорным кольцом * "
          },
          {
            id: 7,
            name: "N1 *",
            description: "один крепежный паз на одной стороне наружного кольца * "
          },
          {
            id: 8,
            name: "R *",
            description: "подшипник с фланцем на внешнем кольце * "
          },
          {
            id: 9,
            name: "E *",
            description: "усиленная группа элементов качения * "
          },
          {
            id: 10,
            name: "M",
            description: "латунный сепаратор на элементах качения"
          },
          {
            id: 11,
            name: "MA",
            description: "латунный сепратор на внешнем кольце "
          },
          {
            id: 12,
            name: "MB",
            description: "латунный сепаратор на внутреннем кольце"
          }
        ],
        prefixes:[
          {
            id: 1,
            name: "SS *",
            description: "нержавеющая сталь *"
          }
        ],
        radialClearances:[
          {
            id:1,
            name: 'C2',
            description:'зазор подшипника меньше нормального '
          },
          {
            id:2,
            name: 'CN',
            description:'нормальный зазор'
          },
          {
            id:3,
            name: 'C3',
            description:'зазор подшипника больше нормального'
          },
          {
            id:4,
            name: 'C4',
            description:'зазор в подшипнике больше чем С3 '
          },
          {
            id:5,
            name: 'C5',
            description:'зазор в подшипнике больше чем C4 '
          }
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0) '
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) * '
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          }
        ]
      }
    },
    {
      id: "angular-contact-ball-bearings",
      name: 'Радиально-упорные шарикоподшипники',
      productNumber: 2,
      productImage: '/imports/products/products-bg-2.svg',
      previewText: 'Универсальная и экономичная конструкция радиальноупорных шарикоподшипников позволяет успешно применять их практически во всех отраслях промышленности, например, в автомобилестроении (ступицы колес).',

      productInfoAboveBearing: "Универсальная и экономичная конструкция радиальноупорных шарикоподшипников позволяет успешно применять их практически во всех отраслях промышленности, например, в автомобилестроении (ступицы колес). Очень важным аспектом конструкции радиально-упорных шарикоподшипников является факт, что они переносят как радиальные, так и осевые нагрузки в соответствующем направлении.",
      productInfoAboveBluePrint: "Это связано с тем, что беговая дорожка внешнего кольца расположена под углом, что позволяет намного более эффективно переносить осевые нагрузки в направлении наклона. Чтобы обеспечить соответствующую стойкость и производительность, необходимо подобрать подшипник на основании рабочего угла дорожки. Она может находиться под углом 30°, 40° или 25° соответственно. Сепараторы для такого типа конструкций это, прежде всего, полиамидные элементы, дополнительно усиленные стекловолокном, однако в предложение входят также модели с металлическими или латунными сепараторами. Элементами качения являются шарики, в связи с чем подшипник работает очень тихо, элементы движутся плавно, что обеспечивает высокую производительность даже при высоких оборотах.",
      productInfoAboveBearIcon: "Радиально-упорные шарикоподшипники доступны в однорядном и двухрядном вариантах одностороннего действия, а также однорядном двустороннего действия. Два первых – это классическая конструкция, с успехом применяющаяся в ступицах колес, повсеместно устанавливаемых в автомобилях. Радиально-упорные однорядные двустороннего действия подшипники работают похожим способом, перенося нагрузки в обе стороны, однако нетипичная конструкция позволяет их применять в структурах, требующих большей точности. Также стоит отметить, что такого типа подшипники часто используются парами, однако можно встретить конструкции, в которых используются большие комбинации – тройные или четверные. ",
      productInfoUnderBearIcon: "Заботясь о высочайшем качестве производимых подшипников, была создана специальная линейка продуктов марки VTL с наименованием SilverBear+ для Клиентов, ожидания и требования которых превышают стандартные. Использованные материалы, конструкционные и технологические решения, а также продвинутый контроль качества в случае данных подшипников позволяют получить рабочие параметры, в том числе грузоподъемность и скорость, превышающие стандартные продукты на 5-30%. Универсальная и экономичная конструкция радиально- -упорных шарикоподшипников позволяет успешно их применять практически во всех отраслях промышленности, например в автомобильной (ступицы колес)",

      productBlueprintTitle: "Радиально-упорные шарикоподшипники",
      productBlueprintImages:[
      {
        id: 1,
        imagePath: '/imports/blueprints/blueprint_2-1.svg'
      }
    ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "A",
            description: "передний угол 30 °"
          },
          {
            id: 2,
            name: "B",
            description: "передний угол 40 °"
          },
          {
            id: 3,
            name: "AC",
            description: "передний угол 25 °"
          },
          {
            id: 4,
            name: "P",
            description: "полиамидный сепаратор, выполненный из материала РА66, усиленный "
          },
          {
            id: 5,
            name: "J",
            description: "стальной штампованный сепаратор, ведомыйна элементах качения, незакаленный"
          },
          {
            id: 6,
            name: "M",
            description: "латунный сепаратор на элементах качения"
          },
          {
            id: 7,
            name: "UA *",
            description: "в универсальной парной установке подшипников (схема тандем), подшипниковые пары О и Х имеют небольшой осевой зазорwy *"
          },
          {
            id: 8,
            name: "UL *",
            description: "в универсальной парной установке подшипников, подшипниковые пары О и Х имеют малый предварительный натяг *"
          },
          {
            id: 9,
            name: "UO *",
            description: "в универсальной парной установке подшипников, подшипниковые пары О и Х не имеют зазора *"
          },
          {
            id: 10,
            name: "RS / 2RS",
            description: "бесконтактное уплотнение из бутадиен -акрилонитрилового каучука (NBR) с одной / обеих сторон подшипника"
          },
          {
            id: 11,
            name: "Z / ZZ",
            description: "бесконтактная защитная металическая пластинка с одной / обеих сторон подшипника"
          },
          {
            id: 12,
            name: "N2",
            description: "два крепежных отверстия на одной стороне наружного"
          },
          {
            id: 13,
            name: "MA",
            description: "латунный сепаратор машинной обработки, ведомый на внешнем кольце"
          },
        ],
        axialClearances:[
          {
            id:1,
            name: 'C2',
            description:'зазор подшипника меньше нормального'
          },
          {
            id:2,
            name: 'CN',
            description:'нормальный зазор'
          },
          {
            id:3,
            name: 'C3',
            description:'зазор подшипника больше нормального'
          },
          {
            id:4,
            name: 'C4',
            description:'зазор в подшипнике больше чем С3'
          },
          {
            id:5,
            name: 'C5',
            description:'зазор в подшипнике больше чем C4'
          }
        ],
        accuracyClasses:[
          {
            id: 1,
            name: 'P0',
            description: 'нормальная (стандартный класс точности)'
          },
          {
            id: 2,
            name: 'P6',
            description: 'повышенная (класс точности выше P0'
          },
          {
            id: 3,
            name: 'P5',
            description: 'высокая (класс точности выше P6) *'
          },
          {
            id: 4,
            name: 'P4',
            description: 'прецизионная (класс точности выше, чем P5) *'
          }
        ]
      }
    },
    {
      id: "",
      name: '',
      productNumber: 1,
      productImage: '/imports/products/products-bg-1.svg',
      previewText: '',

      productInfoAboveBearing: "",
      productInfoAboveBluePrint: "",
      productInfoAboveBearIcon: "",
      productInfoUnderBearIcon: "",

      productBlueprintTitle: "",
      productBlueprintImages:[
      {
        id: 1,
        imagePath: ''
      }
    ],

      marking:{
        suffixes:[
          {
            id: 1,
            name: "",
            description: ""
          }
        ],
        prefixes:[
          {
            id: 1,
            name: "",
            description: ""
          }
        ],
        radialClearances:[
          {
            id:1,
            name: '',
            description:''
          }
        ],
        accuracyClasses:[
          {
            id: 1,
            name: '',
            description: ''
          }
        ]
      }
    },
  ]